15rpm/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    innerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1200;
        startFace       103950;
    }
    outerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1200;
        startFace       105150;
    }
    bottomWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2400;
        startFace       106350;
    }
    topWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2400;
        startFace       108750;
    }
    inlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          450;
        startFace       111150;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  outlet;
    }
    outlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          450;
        startFace       111600;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inlet;
    }
)

// ************************************************************************* //
